<template>
  <div class="mask_box">
    <svg
      ref="mask_svg_pc"
      version="1.1"
      xmlns="http://www.w3.org/2000/svg"
      xmlns:xlink="http://www.w3.org/1999/xlink"
      viewBox="0 0 800 700"
      xml:space="preserve"
      class="mask_svg pc"
    >
      <filter id="drop-shadow">
        <!-- 図形の影をSourceAlphaで取得、ぼかす-->
        <feGaussianBlur in="SourceAlpha" stdDeviation="10" />
      </filter>
      <g>
        <path
          ref="mask_path"
          class="mask_path"
          d="M431.168,195.248s24.629-98.77,127.457-125.6S825.135,84.283,838.169,235.484,641.249,520.82,587.6,558.62,478.963,668.354,470.273,686.652s-5.8,9.751-5.8,9.751S315.283,559.833,212.443,459.85,27.851,304.059,79.685,173.376s266.024-128.1,358.574,46.111c0,0,12.513-36.963,14.442-41.137,14.385-31.268,34.964-133.071,276.855-97.716,217.179,80.986,33.75,318.218-17.38,354.834S460.143,635.443,451.453,701.283c0,0-141.468-136.054-224.511-204.855S56.363,266.653,107.063,159.346,335.919,87.768,440.21,224.339c0,0-19.413-107.658,62.7-143.7S745.467,66.3,795.489,166.34s-31.881,188.647-94.163,293.51-220.9,191.437-229.589,248.739c0,0-139.052-160.952-208.572-206.068S-2.852,388.765,67.617,151.6C84.984,94.927,240.771,36.884,374.683,131.843c49.168,34.868,60.83,57.312,60.83,57.312"
          transform="translate(-46.726 -35.536)"
        />
      </g>
    </svg>
    <svg
      ref="mask_svg_sp"
      version="1.1"
      xmlns="http://www.w3.org/2000/svg"
      xmlns:xlink="http://www.w3.org/1999/xlink"
      viewBox="0 0 800 800"
      xml:space="preserve"
      class="mask_svg sp"
    >
      <g>
        <path
          ref="mask_path"
          class="mask_path"
          d="M435.427,225.844S460.333,104.389,564.318,71.4,833.824,89.392,847.006,275.32,647.87,626.191,593.618,672.673,483.759,807.609,474.971,830.11s-5.862,11.99-5.862,11.99S318.237,674.164,214.241,551.218,27.573,359.646,79.99,198.947,349.006,41.43,442.6,255.649c0,0,12.654-45.453,14.6-50.585C471.748,166.615,492.559,41.43,737.171,84.906c219.622,99.586,34.13,391.3-17.576,436.33S464.727,767.14,455.939,848.1c0,0-143.059-167.3-227.036-251.905S56.406,313.649,107.675,181.7s231.43-88.017,336.895,79.92c0,0-19.632-132.385,63.4-176.709S753.261,67.275,803.846,190.3s-32.24,231.975-95.222,360.922S485.239,786.623,476.451,857.086c0,0-140.616-197.919-210.918-253.4S-3.476,463.806,67.786,172.166c17.562-69.685,175.1-141.058,310.52-24.29,49.721,42.877,61.514,70.475,61.514,70.475"
          transform="translate(-50.662 -57.086)"
        />
      </g>
    </svg>
  </div>
</template>

<script>
import Vue from 'vue'
export default Vue.extend({
  data() {
    return {}
  },
  mounted() {
    console.log('heart mask')
  }
})
</script>

<style lang="scss" scoped>
.mask {
  &_box {
    width: 100%;
    height: 87%;
    max-height: 700px;
    max-width: 800px;
    margin: 0 auto;
    @include tablet {
      height: 100%;
      padding: 10px;
    }
  }
  &_svg {
    width: 100%;
    height: 100%;
    &.sp {
      display: none;
    }
    &.pc {
      display: block;
    }
    @include tablet {
      &.sp {
        display: block;
      }
      &.pc {
        display: none;
      }
    }
  }

  &_path {
    // fill: none;
    stroke: var(--main-color);
    stroke-width: 2;
    stroke-linecap: round;
    stroke-linejoin: round;
    fill: rgba(255, 255, 255, 0.8);
  }
}
</style>
